# SetLayoutAsFixedNumber Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarFreeFormAccessor..::..SetLayoutAsFixedNumber Method
RebarFreeFormAccessor Class See Also
---
Sets the Layout Rule property of rebar set to Fixed Number.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public void SetLayoutAsFixedNumber(
	int numberOfBars
)
```

Visual Basic
---
```text
Public Sub SetLayoutAsFixedNumber ( _
	numberOfBars As Integer _
)
```

Visual C++
---
```text
public:
void SetLayoutAsFixedNumber(
	int numberOfBars
)
```

# ### Parameters
numberOfBars
    Type: System..::..Int32 The number of bars in set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID. |

# See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace